function data = down_update(data)
%向下更新按钮
    %每列不为0的数据从下到上依次遍历，若当前点与下一点取值相等，则该点取值*2，下一点赋值为0
    for i=1:4
        %提取每一列数据
        a=data(:,i);
        %删除每一列中所有为0的点，
        %并在最上面补0，保证维度不变
        a(find(a==0))=[];
        a=[zeros(4-length(a),1);a];
        for j=4:-1:2            
            if a(j)==a(j-1)  %遍历该列中每一个点，如果上一个点与该点取值相等，
                a(j)=2*a(j);%该点取值×2，下一个点赋0
                a(j-1)=0;
            end
        end      
        a(find(a==0))=[]; %删除每一列中所有为0的点，
        a=[zeros(4-length(a),1);a];  %并在前面补0，保证维度不变
        data(:,i)=a;  %并把更新后的列，重新赋给data
    end
end

