function data = left_update(data)
%向左更新按钮
    %每行不为0的数据从左到右依次遍历，若当前点与下一点取值相等，则该点取值*2，下一点赋值为0
    for i=1:4
        %提取每一行的数据
        a=data(i,:);
        %删除每一行中所有为0的点，
        %并在右边补0，保证维度不变
        a(find(a==0))=[];
        a(length(a)+1:4)=0;
        for j=1:3
            %遍历该行中每一个点，如果下一个点与该点取值相等，
            %该点取值×2，下一个点赋0
            if a(j)==a(j+1)
                a(j)=2*a(j);
                a(j+1)=0;
            end
        end     
        a(find(a==0))=[];  %删除每一行中所有为0的点，
        a(length(a)+1:4)=0; %并在右边补0，保证维度不变
        data(i,:)=a;  %并把更新后的行，重新赋给data
    end
end



